{
    "books": [
      {
        "image": "https://example.com/book_image1.jpg",
        "name": "The Great Gatsby",
        "quantity": 15,
        "author": "F. Scott Fitzgerald",
        "category": "Novel",
        "description": "Set in the Jazz Age, this novel explores themes of decadence, idealism, and excess.",
        "rating": 5,
        "contents": "The Great Gatsby follows the story of Jay Gatsby, a mysterious millionaire who throws lavish parties in the hope of winning back his lost love, Daisy Buchanan."
      },
      {
        "image": "https://example.com/book_image2.jpg",
        "name": "To Kill a Mockingbird",
        "quantity": 12,
        "author": "Harper Lee",
        "category": "Novel",
        "description": "This classic novel deals with racial injustice and moral growth in the American South.",
        "rating": 4,
        "contents": "To Kill a Mockingbird tells the story of Scout Finch, a young girl growing up in the racially charged atmosphere of Alabama during the 1930s."
      },
      {
        "image": "https://example.com/book_image3.jpg",
        "name": "The Hobbit",
        "quantity": 20,
        "author": "J.R.R. Tolkien",
        "category": "Novel",
        "description": "An enchanting tale of adventure, friendship, and courage, set in the fictional world of Middle-earth.",
        "rating": 5,
        "contents": "The Hobbit follows the journey of Bilbo Baggins, a hobbit who is recruited by the wizard Gandalf to accompany a group of dwarves on a quest to reclaim their homeland from a fearsome dragon."
      },
      {
        "image": "https://example.com/book_image4.jpg",
        "name": "1984",
        "quantity": 8,
        "author": "George Orwell",
        "category": "Novel",
        "description": "A dystopian novel that explores themes of totalitarianism, surveillance, and individual freedom.",
        "rating": 4,
        "contents": "1984 portrays a society under constant surveillance by the authoritarian regime of Big Brother, where independent thought is punished and truth is manipulated."
      },
      {
        "image": "https://example.com/book_image5.jpg",
        "name": "The Da Vinci Code",
        "quantity": 18,
        "author": "Dan Brown",
        "category": "Thriller",
        "description": "A gripping thriller that unravels a centuries-old secret involving a conspiracy at the heart of Christianity.",
        "rating": 4,
        "contents": "The Da Vinci Code follows the Harvard symbologist Robert Langdon as he investigates a murder in the Louvre and uncovers clues that lead to a shocking revelation."
      },
      {
        "image": "https://example.com/book_image6.jpg",
        "name": "Gone Girl",
        "quantity": 10,
        "author": "Gillian Flynn",
        "category": "Thriller",
        "description": "A psychological thriller that keeps readers guessing until the very end.",
        "rating": 5,
        "contents": "Gone Girl tells the story of Nick and Amy Dunne, whose marriage takes a dark turn when Amy goes missing on their fifth wedding anniversary."
      },
      {
        "image": "https://example.com/book_image7.jpg",
        "name": "The Girl with the Dragon Tattoo",
        "quantity": 14,
        "author": "Stieg Larsson",
        "category": "Thriller",
        "description": "The first book in the Millennium series, featuring an unforgettable heroine and a complex mystery.",
        "rating": 4,
        "contents": "The Girl with the Dragon Tattoo introduces Lisbeth Salander, a brilliant but troubled hacker, and Mikael Blomkvist, an investigative journalist, as they join forces to solve a decades-old disappearance."
      },
      {
        "image": "https://example.com/book_image8.jpg",
        "name": "The Silence of the Lambs",
        "quantity": 6,
        "author": "Thomas Harris",
        "category": "Thriller",
        "description": "A chilling psychological thriller that pits an FBI trainee against a brilliant but monstrous serial killer.",
        "rating": 5,
        "contents": "The Silence of the Lambs follows FBI trainee Clarice Starling as she seeks the help of incarcerated serial killer Hannibal Lecter to catch another killer, known as Buffalo Bill."
      },
      {
        "image": "https://example.com/book_image9.jpg",
        "name": "Sapiens: A Brief History of Humankind",
        "quantity": 22,
        "author": "Yuval Noah Harari",
        "category": "History",
        "description": "An engaging exploration of the history of Homo sapiens, from the emergence of our species to the present day.",
        "rating": 5,
        "contents": "Sapiens examines key developments in human history, from the cognitive revolution to the agricultural revolution, and their impact on society and culture."
      },
      {
        "image": "https://example.com/book_image10.jpg",
        "name": "The Rise and Fall of the Third Reich",
        "quantity": 9,
        "author": "William L. Shirer",
        "category": "History",
        "description": "A comprehensive history of Nazi Germany, from Hitler's rise to power to the end of World War II.",
        "rating": 4,
        "contents": "The Rise and Fall of the Third Reich offers a detailed account of the events that shaped one of the darkest periods in human history, including Hitler's totalitarian regime and the Holocaust."
      },
      {
        "image": "https://example.com/book_image11.jpg",
        "name": "A People's History of the United States",
        "quantity": 11,
        "author": "Howard Zinn",
        "category": "History",
        "description": "A groundbreaking work that presents American history from the perspective of marginalized groups and social movements.",
        "rating": 5,
        "contents": "A People's History of the United States challenges traditional narratives of American history by highlighting the struggles and achievements of ordinary people, from Native Americans to labor activists."
      },
      {
        "image": "https://example.com/book_image12.jpg",
        "name": "Genghis Khan and the Making of the Modern World",
        "quantity": 7,
        "author": "Jack Weatherford",
        "category": "History",
        "description": "An illuminating account of the life and legacy of Genghis Khan, one of history's most influential leaders.",
        "rating": 4,
        "contents": "Genghis Khan and the Making of the Modern World explores the rise of the Mongol Empire and its impact on global history, from the spread of trade and technology to the exchange of ideas and cultures."
      },
      {
        "image": "https://example.com/book_image13.jpg",
        "name": "Hamlet",
        "quantity": 13,
        "author": "William Shakespeare",
        "category": "Drama",
        "description": "One of Shakespeare's most famous tragedies, exploring themes of revenge, madness, and mortality.",
        "rating": 5,
        "contents": "Hamlet tells the story of the Prince of Denmark, who seeks to avenge his father's murder while grappling with existential questions about life and death."
      },
      {
        "image": "https://example.com/book_image14.jpg",
        "name": "A Streetcar Named Desire",
        "quantity": 16,
        "author": "Tennessee Williams",
        "category": "Drama",
        "description": "A powerful play that delves into the complexities of desire, illusion, and the clash of cultures.",
        "rating": 4,
        "contents": "A Streetcar Named Desire follows the troubled relationship between Blanche DuBois, a fading Southern belle, and Stanley Kowalski, a working-class brute, as they clash in a cramped New Orleans apartment."
      },
      {
        "image": "https://example.com/book_image15.jpg",
        "name": "Death of a Salesman",
        "quantity": 10,
        "author": "Arthur Miller",
        "category": "Drama",
        "description": "A poignant exploration of the American Dream and the disillusionment of one man's life.",
        "rating": 5,
        "contents": "Death of a Salesman follows Willy Loman, a traveling salesman, as he confronts his failures and regrets while trying to secure a better future for his family."
      },
      {
        "image": "https://example.com/book_image16.jpg",
        "name": "Romeo and Juliet",
        "quantity": 8,
        "author": "William Shakespeare",
        "category": "Drama",
        "description": "A timeless tale of star-crossed lovers whose passionate romance is doomed by their feuding families.",
        "rating": 4,
        "contents": "Romeo and Juliet tells the story of two young lovers from rival families, whose forbidden love leads to tragedy in the streets of Verona."
      }
    ]
  }
  